podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/FTFA_MKL82Z7.svd.xml
            <register>
               <name>FACSN</name>
               <description>Flash Access Segment Number Register</description>
               <addressOffset>0x2B</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>NUMSG</name>
                     <description>Number of Segments Indicator</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>100000</name>
                           <description>Program flash memory is divided into 32 segments (64 Kbytes, 128 Kbytes)</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101000</name>
                           <description>Program flash memory is divided into 40 segments (160 Kbytes)</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1000000</name>
                           <description>Program flash memory is divided into 64 segments (256 Kbytes, 512 Kbytes)</description>
                           <value>0b1000000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
